str1 = "设置屏幕的宽度，单位：像素。\n过大的尺寸可能导致帧数受限/UI过小。\n手机1080P: 1920x1080（16：9）\n平板1080P: 1440x1080（4：3）"
str2 = "设置屏幕的高度，单位：像素。\n过大的尺寸可能导致帧数受限/UI过小。\n手机1080P: 1920x1080（16：9）\n平板1080P: 1440x1080（4：3）"
str3 = "设置键的大小，单位：像素。\n推荐设置为屏幕宽度的1/10~1/8。"
str4 = "设置击中特效的大小，单位：像素。\n推荐设置为屏幕宽度的1/8~1/6。"

str5 = "显示在连击数下方的文字。\n常设置为“AUTOPLAY”。"
str6 = "显示在左下角的文字。\n常设置为曲名。"
str7 = "显示在右下角的文字。\n常设置为难度。"

str8 = "此功能尚不稳定，谨慎开启！"
str9 = "键下落的流速，不会影响BPM。\n开启立体模式后，由于视野内note的数量增加，\n若不提高流速就会出现“读谱不能”的现象。\n默认值为 2.5（倍速）。"
str10 = "键出现的位置（对应2D谱中距离判定线的位置）。\n单位：像素\n推荐值介于2~4倍窗口高度之间。"
str11 = "摄像机的水平位置。单位：像素。\n坐标原点位于屏幕左上角，向右为水平正方向。\n此值应介于0~屏幕宽度之间，推荐将摄像机放在屏幕中间偏上的位置。"
str12 = "摄像机的垂直位置。单位：像素。\n坐标原点位于屏幕左上角，向下为垂直正方向。\n此值应介于0~屏幕高度之间，推荐将摄像机放在屏幕中间偏上的位置。"
str27 = "摄像机的到屏幕的距离（垂直屏幕向外）。单位：Y。\n默认值为1.0，不建议修改此值。\n摄像机距离屏幕越远，视角越低。"
str26 = "启动器暂未适配此版本"

str13 = "此功能尚不稳定，谨慎开启！"
str14 = "此功能暂时受限，不允许修改。"
str15 = "此功能暂时受限，不允许修改。"
str16 = "此值应当介于0~1（不含端点）之间。\n默认值为 0.2"

str17 = "默认值为 60。\n此值不应过小，推荐值为60~90。\n*请注意，击中特效是固定的42帧。\n*在B站投稿时请确保分辨率不低于1080P，以免帧数受限。"
str18 = "音乐与谱面之间的时差。单位：秒\n当此值为正时，谱面会延后开始，此值可正可负。"
str19 = "背景图面的亮度。\n此值为0时，画面最暗；\n此值为1时，画面最暗；\n此值超出0~1范围时，程序崩溃。"
str20 = "对曲绘进行高斯模糊，此值为模糊半径。请勿调整。"

str21 = "隐藏所有文字、进度条。"
str22 = "输出调试信息。\n可能导致帧数下降。"

str23 = "json\n仅支持官谱！\n请点击右下方“打开文件夹”。"
str24 = "wav/mp3"
str25 = "jpg/png"