# Translate by deepseek.
str1 = "設定螢幕寬度，單位：像素。\n過大尺寸可能導致幀數受限/介面過小。\n手機1080P：1920x1080（16：9）\n平板1080P：1440x1080（4：3）"
str2 = "設定螢幕高度，單位：像素。\n過大尺寸可能導致幀數受限/介面過小。\n手機1080P：1920x1080（16：9）\n平板1080P：1440x1080（4：3）"
str3 = "設定按鍵大小，單位：像素。\n建議值為螢幕寬度的1/10~1/8。"
str4 = "設定擊中特效大小，單位：像素。\n建議值為螢幕寬度的1/8~1/6。"

str5 = "顯示在連擊數下方的文字。\n通常設定為「AUTOPLAY」。"
str6 = "顯示在左下角的文字。\n通常設定為曲名。"
str7 = "顯示在右下角的文字。\n通常設定為難度。"

str8 = "此功能尚未穩定，請謹慎開啟！"
str9 = "按鍵下落流速，不影響BPM。\n開啟立體模式後，因視野內音符數量增加，\n若不提高流速將出現「讀譜不能」現象。\n預設值為 2.5（倍速）。"
str10 = "按鍵出現位置（對應2D譜面距離判定線的位置）。\n單位：像素\n建議值介於2~4倍視窗高度之間。"
str11 = "攝影機水平位置。單位：像素。\n座標原點位於螢幕左上角，水平正方向向右。\n此值應介於0~螢幕寬度，建議置於螢幕中上位置。"
str12 = "攝影機垂直位置。單位：像素。\n座標原點位於螢幕左上角，垂直正方向向下。\n此值應介於0~螢幕高度，建議置於螢幕中上位置。"
str27 = "攝影機到螢幕的距離（垂直螢幕向外）。單位：Y。\n預設值為1.0，不建議修改此值。\n攝影機距離螢幕越遠，視角越低。"
str26 = "啟用後將下壓譜面並上移攝影機，據稱有助於讀譜。"

str13 = "此功能尚未穩定，請謹慎開啟！"
str14 = "此功能暫時受限，不允許修改。"
str15 = "此功能暫時受限，不允許修改。"
str16 = "此值應介於0~1（不含端點）之間。\n預設值為 0.2"

str17 = "預設值為 60。\n此值不宜過小，建議值60~90。\n*請注意，擊中特效固定為42幀。\n*於B站投稿時請確保解析度不低於1080P，以免幀數受限。"
str18 = "音樂與譜面間的時間差。單位：秒\n正值時譜面延後開始，此值可正可負。"
str19 = "背景圖面亮度。\n此值為0時畫面最暗；\n此值為1時畫面最亮；\n超出0~1範圍將導致程式崩潰。"
str20 = "對曲繪進行高斯模糊，此值為模糊半徑。請勿調整。"

str21 = "隱藏所有文字、進度條。"
str22 = "輸出除錯資訊。\n可能導致幀數下降。"

str23 = "json\n注意：RPE自製譜將自動轉譯為官方譜格式。\n請點擊右下方「打开文件夹」。"
str24 = "wav/mp3"
str25 = "jpg/png"

str28 = "1、未經原譜師同意，請勿將譜面上傳至社群。"
str29 = "2、對RPE自製譜的支援尚不完備，請勿使用轉譜器處理自製譜，不保證能正確讀取自製譜。"
str30 = "3、轉譜器效能消耗較大，請預留至少4~8GB記憶體與3GB儲存空間，防止轉譜過程記憶體不足崩潰。"
str31 = "4、降低幀率可有效提升轉譜速度、減少記憶體消耗。輸出譜面採用線性實踐，降低幀率對最終效果影響較小，但不建議低於30幀。"

str32 = "啟用後，PhiChart將生成可匯入模擬器遊玩的譜面檔案。"
str33 = "僅用於標記，無實際作用。"
str34 = "識別不同譜面檔案的唯一識別碼，可為任意正整數。"