str1 = "設定畫面的寬度，單位：像素。\n過大的尺寸可能導致幀率受限/UI過小。\n手機1080P: 1920x1080（16：9）\n平板1080P: 1440x1080（4：3）"
str2 = "設定畫面的高度，單位：像素。\n過大的尺寸可能導致幀率受限/UI過小。\n手機1080P: 1920x1080（16：9）\n平板1080P: 1440x1080（4：3）"
str3 = "設定按鍵的大小，單位：像素。\n建議設定為畫面寬度的1/10~1/8。"
str4 = "設定擊中特效的大小，單位：像素。\n建議設定為畫面寬度的1/8~1/6。"

str5 = "顯示在連擊數下方的文字。\n常設定為「AUTOPLAY」。"
str6 = "顯示在左下角的文字。\n常設定為曲目名稱。"
str7 = "顯示在右下角的文字。\n常設定為難度。"

str8 = "此功能尚不穩定，請謹慎啟用！"
str9 = "按鍵下落的流速倍率，不會影響BPM。\n啟用立體模式後，由於視野內note的數量增加，\n若不提高流速就會出現「譜面過於密集難以辨識」的現象。\n預設值為 2.5（倍速）。"
str10 = "按鍵出現的位置（對應2D譜面中距離判定線的位置）。\n單位：像素\n建議值介於2~4倍視窗高度之間。"
str11 = "攝影機的水平位置。單位：像素。\n座標原點位於畫面左上角，向右為水平正方向。\n此值應介於0~畫面寬度之間，建議將攝影機放在畫面中間偏上的位置。"
str12 = "攝影機的垂直位置。單位：像素。\n座標原點位於畫面左上角，向下為垂直正方向。\n此值應介於0~畫面高度之間，建議將攝影機放在畫面中間偏上的位置。"
str27 = "攝影機到畫面的距離（垂直於畫面向外）。單位：Y。\n預設值為1.0，不建議修改此值。\n攝影機距離畫面越遠，視角越低。"
str26 = "啟動器暫未支援此版本"

str13 = "此功能尚不穩定，請謹慎啟用！"
str14 = "此功能暫時受限，不允許修改。"
str15 = "此功能暫時受限，不允許修改。"
str16 = "此值應當介於0~1（不含端點）之間。\n預設值為 0.2"

str17 = "預設值為 60。\n此值不應過小，建議值為60~90。\n*請注意，擊中特效是固定的42幀。\n*在B站投稿時請確保解析度不低於1080P，以免幀率受限。"
str18 = "音樂與譜面之間的時間差。單位：秒\n當此值為正時，譜面會延後開始，此值可正可負。"
str19 = "背景圖面的亮度。\n此值為0時，畫面最暗；\n此值為1時，畫面最亮；\n此值超出0~1範圍時，程式將崩潰。"
str20 = "對專輯封面進行高斯模糊，此值為模糊半徑。不建議調整。"

str21 = "隱藏所有文字、進度條。"
str22 = "輸出除錯資訊。\n可能導致幀率下降。"

str23 = "json\n僅支援官方譜面！\n請點選右下方「開啟資料夾」。"
str24 = "wav/mp3"
str25 = "jpg/png"